{"url":"https://api.github.com/repos/sktime/sktime/issues/3882","repository_url":"https://api.github.com/repos/sktime/sktime","labels_url":"https://api.github.com/repos/sktime/sktime/issues/3882/labels{/name}","comments_url":"https://api.github.com/repos/sktime/sktime/issues/3882/comments","events_url":"https://api.github.com/repos/sktime/sktime/issues/3882/events","html_url":"https://github.com/sktime/sktime/issues/3882","id":1474278298,"node_id":"I_kwDOCVKAsc5X37Oa","number":3882,"title":"[GOV] recent GOV proposals - how to proceed","user":{"login":"fkiraly","id":7985502,"node_id":"MDQ6VXNlcjc5ODU1MDI=","avatar_url":"https://avatars.githubusercontent.com/u/7985502?v=4","gravatar_id":"","url":"https://api.github.com/users/fkiraly","html_url":"https://github.com/fkiraly","followers_url":"https://api.github.com/users/fkiraly/followers","following_url":"https://api.github.com/users/fkiraly/following{/other_user}","gists_url":"https://api.github.com/users/fkiraly/gists{/gist_id}","starred_url":"https://api.github.com/users/fkiraly/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/fkiraly/subscriptions","organizations_url":"https://api.github.com/users/fkiraly/orgs","repos_url":"https://api.github.com/users/fkiraly/repos","events_url":"https://api.github.com/users/fkiraly/events{/privacy}","received_events_url":"https://api.github.com/users/fkiraly/received_events","type":"User","site_admin":false},"labels":[{"id":2163929092,"node_id":"MDU6TGFiZWwyMTYzOTI5MDky","url":"https://api.github.com/repos/sktime/sktime/labels/governance","name":"governance","color":"edd69e","default":false,"description":"Governance and community management"},{"id":3796180314,"node_id":"LA_kwDOCVKAsc7iRR1a","url":"https://api.github.com/repos/sktime/sktime/labels/enhancement","name":"enhancement","color":"fef2c0","default":true,"description":"Adding new functionality"}],"state":"open","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":2,"created_at":"2022-12-03T23:39:43Z","updated_at":"2022-12-07T19:47:02Z","closed_at":null,"author_association":"COLLABORATOR","active_lock_reason":null,"body":"We need to ensure that we proceed correctly on recent suggested changes to `sktime` decision making, both from a procedural perspective and from an accountability perspective.\r\n\r\nWe need to ensure:\r\n\r\n* that we preserve [separation of powers/duties](https://en.wikipedia.org/wiki/Separation_of_duties), removing them would weaken accountability and enable corruption. A combination of recent proposed measures can lead to concentration of powers, as follows: [making the core dev vote override policy decisions](https://github.com/sktime/sktime/pull/3867), and making the [core devs the last authority in appointments](https://github.com/sktime/sktime/pull/3866) (these being in two separate PR makes it harder to see)\r\n* changes ensure governance is representative for the `sktime` community or the user community - among core devs there are large single issue groups, and the `sktime` contributor community has long outgrown its narrow roots in few academic research groups. Making the core dev vote the single vote that overrides all would in consequence disenfranchise minorities in the active contributor community, especially when combined with removing any mutual checks between committees.\r\n* we need to ensure that the process is consensus based and takes place in regular developer and CC meetings. Recent lapses in attendance of these meetings are problematic, and procedural norms of the past years would require substantial changes to be presented in said meetings.\r\n* there are recent discussions on code of conduct and resource allocations decisions which should be resolved first: https://github.com/sktime/sktime/pull/3674. Otherwise, decisions that (directly or indirectly) remove power from the code of conduct committee, or remove its independence, could easily be interpreted as massive conflicts of interest.\r\n* on `sktime` internal channels this has caused heated discussions and behaviour that, in my opinion, was unacceptable. No matter the nature of proposed changes, this needs to stop before we engage with change requests to the governance models. If we are to consider these proposals, it must happen in an environment that is not charged with emotion, fear and hurt.\r\n\r\nIn particular, if we want to make sweeping changes like this, I think we need more than just push these through a core dev or CC vote of whatever majorities there are.\r\n\r\nI think this requires at least:\r\n\r\n* a workshop where all core devs are properly briefed of pros/cons; ample opportunity for Q&A before any change is made, at least in the order of months\r\n* multiple readings in transparently minuted CC meetings. Core developers needs to start attending the CC meetings again and adhere to the process of minuting and minute confirmation.\r\n* de-escalation of any combative dynamics in internal `sktime` channels\r\n* sufficient room for critical voices, e.g., to explain how the multiple PR in combination erode separation of duties or corruption checks\r\n\r\nContent-wise, we need to consider and discuss clearly:\r\n\r\n* if we introduce more direct elements of democracy, who is the electorate? Should it perhaps not be active users and contributors, e.g., on slack, rather than just the core developer group? For example: our users are international, and there is a strong skew towards the UK and lack of diversity in `sktime`'s academic core developers.\r\n* if we introduce term limits, should there not also be proper elections, at regular intervals? Rather than just having run term limits running out one by one until there is just one CC member left (or none in the end)?\r\n* how do proposed changes affect checks and balances, e.g., ability of a coordinated small group of people seize `sktime` assets and lock everyone else out?\r\n* how do proposed changes affect the CoC committee's ability to deal with bullying and harassment, especially targeted at minorities?\r\n* who oversees proper conduct of elections if separation of duties is abolished?\r\n\r\nThese are hard and serious questions, so we cannot just rush these changes through.","closed_by":null,"reactions":{"url":"https://api.github.com/repos/sktime/sktime/issues/3882/reactions","total_count":0,"+1":0,"-1":0,"laugh":0,"hooray":0,"confused":0,"heart":0,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/sktime/sktime/issues/3882/timeline","performed_via_github_app":null,"state_reason":null}