{"url":"https://api.github.com/repos/allenai/scispacy/issues/100","repository_url":"https://api.github.com/repos/allenai/scispacy","labels_url":"https://api.github.com/repos/allenai/scispacy/issues/100/labels{/name}","comments_url":"https://api.github.com/repos/allenai/scispacy/issues/100/comments","events_url":"https://api.github.com/repos/allenai/scispacy/issues/100/events","html_url":"https://github.com/allenai/scispacy/issues/100","id":436624804,"node_id":"MDU6SXNzdWU0MzY2MjQ4MDQ=","number":100,"title":"Under/over-splitting in BioNLP09: common cases","user":{"login":"alanramponi","id":5367469,"node_id":"MDQ6VXNlcjUzNjc0Njk=","avatar_url":"https://avatars.githubusercontent.com/u/5367469?v=4","gravatar_id":"","url":"https://api.github.com/users/alanramponi","html_url":"https://github.com/alanramponi","followers_url":"https://api.github.com/users/alanramponi/followers","following_url":"https://api.github.com/users/alanramponi/following{/other_user}","gists_url":"https://api.github.com/users/alanramponi/gists{/gist_id}","starred_url":"https://api.github.com/users/alanramponi/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/alanramponi/subscriptions","organizations_url":"https://api.github.com/users/alanramponi/orgs","repos_url":"https://api.github.com/users/alanramponi/repos","events_url":"https://api.github.com/users/alanramponi/events{/privacy}","received_events_url":"https://api.github.com/users/alanramponi/received_events","type":"User","site_admin":false},"labels":[],"state":"closed","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":2,"created_at":"2019-04-24T10:43:43Z","updated_at":"2019-12-11T00:26:45Z","closed_at":"2019-12-11T00:26:45Z","author_association":"NONE","active_lock_reason":null,"body":"Hi everyone, and thank you very much for your great work!\r\n\r\nI tried the scispacy `en_core_sci_md` model on the [BioNLP09 corpus](http://www.nactem.ac.uk/tsujii/GENIA/SharedTask/index.shtml) and I noticed an improved sentence segmentation accuracy w.r.t. the default written text genre `en_core_web_md` model.  I read your [paper](https://arxiv.org/abs/1902.07669) and I'm excited that the rule-based segmenter module is not usually needed due to the in-domain dependency parser training.\r\n\r\nHowever, I noticed some recurrent errors that I want to share with you, since they occur on the aforementioned, widely used BioNLP corpus. I collected many examples that I'm reporting here, and that can be summarized as:\r\n- Oversplitting after \"+/-\" or at the dot in \"p50.c-rel\"\r\n- Undersplitting after a capital letter followed by a dot (e.g., kappa B., kinase A., Cya.)\r\n\r\nYou can also find attached a list of other less common errors I screened ([other_errors.txt](https://github.com/allenai/scispacy/files/3111859/other_errors.txt)), but I think even just identify a solution for and/or handling these cases would be great since they represent the majority of errors (~75%) in the BioNLP09 corpus! \r\n\r\nWhat would you recommend for handling these cases? Are they easily manageable by adding tokenization rules or you suggest to have a custom module to workaround the problem?\r\n\r\nThank you very much indeed!\r\nAlan\r\n\r\n_____\r\n\r\n**Oversplitting after \"+/-\"**\r\n\r\nExample 1\r\n- PDBu + iono induced equally high IL-2 levels in both groups and, when stimulated with plate-bound anti-CD3 monoclonal antibody (mAb), the IL-2 secretion by neonatal cells was undetectable and adult cells produced low amounts of IL-2 (mean 331 +/-\r\n- 86 pg/ml).\r\n\r\nExample 2\r\n- The addition of anti-CD28 mAb to anti-CD3-stimulated cells markedly increased IL-2 production in both cell types, but levels of IL-2 in neonatal T cells remained clearly lower than those of adult T cells (respective mean values: 385 +/-\r\n- 109 pg/ml and 4494 +/-\r\n- 1199 pg/ml).\r\n\r\nExample 3\r\n- Maximal inhibition of IgE production for B cells was at 10(-8) mol/L for all-trans RA (94% +/-\r\n- 1.8%) and 96% +/-\r\n- 3.2% for 13-cis RA.\r\n\r\nExample 4\r\n- Anti-CD40 + IL-4-mediated proliferation of PBMC and B cells was inhibited by RA in a dose-dependent manner, with maximal inhibition of 62% +/-\r\n- 5% in PBMC and 55% +/-\r\n- 4.4% in B cells by all-trans RA, and 58% +/-\r\n- 6.7% and 51% +/-\r\n- 4.7%, respectively by 13-cis RA.\r\n\r\nExample 5\r\n- By immunocytochemistry, 25 +/-\r\n- 7% of the human neutrophils were shown to express immunoreactive GH, whereas eosinophils were negative.\r\n\r\nExample 6\r\n- TCP succinate (200 microM, 24 h) reduced TNF-induced VCAM-1 and E-selectin expression from a specific mean fluorescence intensity of 151 +/- 28 to 12 +/-\r\n- 4 channels and from 225 +/- 38 to 79 +/-\r\n- 21 channels, respectively.\r\n\r\nExample 7\r\n- In this study, we report that both Exosurf and Survanta suppress TNF mRNA and secretion (85 +/-\r\n- 4% mean percent inhibition +/-\r\n- SEM by Exosurf; 71 +/-\r\n- 6% by Survanta) by endotoxin-stimulated THP-1, a human monocytic cell line.\r\n\r\n**Oversplitting in between \"p65.c-Rel\" / \"p50-.c-Rel\"**\r\n\r\nExample 1\r\n- p65 or as p50.\r\n- c-Rel heterodimers.\r\n\r\nExample 2\r\n- p50.\r\n- c-rel heterodimers were also detected bound to this sequence at early time points (7-16 h; early), and both remained active at later time points (40 h; late) after activation.\r\n\r\nExample 3\r\n- However, immediately after TcR/CD3 cross-linking (after approximately 1 h; immediate) binding of p50.\r\n- p65 heterodimers was observed.\r\n\r\n**Undersplitting after \"kappa B.\" / \"kappaB.\"**\r\n\r\n- Protein kinase C inhibitor staurosporine, but not cyclic nucleotide-dependent protein kinase inhibitor HA-1004, also dramatically reduced constitutive levels of nuclear NF kappa B. **[SPLIT HERE]** Finally, TPA addition to monocytes infected with HIV-1 inhibited HIV-1 replication, as determined by reverse transcriptase assays, in a concentration-dependent manner.\r\n- The NF-kappa B p65 subunit provides the transactivation activity in this complex and serves as an intracellular receptor for a cytoplasmic inhibitor of NF-kappa B, termed I kappa B. **[SPLIT HERE]** In contrast, NF-kappa B p50 alone fails to stimulate kappa B-directed transcription, and based on prior in vitro studies, is not directly regulated by I kappa B. **[SPLIT HERE]** To investigate the molecular basis for the critical regulatory interaction between NF-kappa B and I kappa B/MAD-3, a series of human NF-kappa B p65 mutants was identified that functionally segregated DNA binding, I kappa B-mediated inhibition, and I kappa B-induced nuclear exclusion of this transcription factor.\r\n- This protein is most similar to the 105-kDa precursor polypeptide of p50-NF-kappa B. **[SPLIT HERE]** Like the 105-kDa precursor, it contains an amino-terminal Rel-related domain of about 300 amino acids and a carboxy-terminal domain containing six full cell cycle or ankyrin repeats.\r\n- The kappa B enhancer of the gene encoding the interleukin-2 (IL-2) receptor alpha chain (IL-2R alpha) is functional only in the hybrids expressing nuclear NF-kappa B. **[SPLIT HERE]** These findings show that nuclear NF-kappa B is necessary to activate the kappa B enhancer, while KBF1 by itself is not sufficient.\r\n- In this report we describe how signals initiated through the type I IL-1R interact with signals from the antigen receptor to synergistically augment the transactivating properties of NF-kappa B. **[SPLIT HERE]** The synergistic antigen receptor initiated signals are mediated through protein kinase C because they can be mimicked by the phorbol ester, 12-O-tetradecanoylphorbol-13-acetate, but not with calcium ionophores; and are staurosporine sensitive but cyclosporine resistant.\r\n- This study demonstrates that human immunodeficiency virus type 1 (HIV-1) Tat protein amplifies the activity of tumor necrosis factor (TNF), a cytokine that stimulates HIV-1 replication through activation of NF-kappa B. **[SPLIT HERE]** In HeLa cells stably transfected with the HIV-1 tat gene (HeLa-tat cells), expression of the Tat protein enhanced both TNF-induced activation of NF-kappa B and TNF-mediated cytotoxicity.\r\n- Treatment of human resting T cells with phorbol esters strongly induced the expression of IL-2R alpha and the activation of NF.kappa B. **[SPLIT HERE]** This activation was due to the translocation of p65 and c-Rel NF.kappa B proteins from cytoplasmic stores to the nucleus, where they bound the kappa B sequence of the IL-2R alpha promoter either as p50.\r\n- A mutant Tax protein deficient in transactivation of genes by the nuclear factor (NF)-kappaB pathway was unable to induce transcriptional activity of IL-1alpha promoter-CAT constructs, but was rescued by exogenous provision of p65/p50 NF-kappaB. **[SPLIT HERE]** We found that two IL-1alpha kappaB-like sites (positions -1,065 to -1,056 and +646 to +655) specifically formed a complex with NF-kappaB-containing nuclear extract from MT-2 cells and that NF-kappaB bound with higher affinity to the 3' NF-kappaB binding site than to the 5' NF-kappaB site.\r\n- Electrophoretic mobility shift assays (EMSAs) demonstrated that unstimulated monocytes predominantly expressed p50 NF-kappa B. **[SPLIT HERE]** Stimulation with LPS or IFN-gamma resulted in the expression of p50 and p65 subunits, while the combination of IFN-gamma plus LPS caused a further increase in the expression of NF-kappa B. **[SPLIT HERE]** With Western blotting, it was shown that nuclear extracts from monocytes contained p50 and p65 protein in response to LPS and IFN-gamma stimulation.\r\n- The effects of IFN-gamma on the transcription factors were specific, since no change was observed in the expression of NF-IL-6 or I kappa B alpha, the inhibitor of NF-kappa B. **[SPLIT HERE]** We conclude that the effects of IFN-gamma on the expression of the transcription factors AP-1 and NF-kappa B may be important for the modulatory effects of IFN-gamma on the cytokine expression in activated human monocytes.\r\n- Protein-DNA complexes of constitutive NF-kappa B are similar in mobility to the LPS-induced NF-kappa B and both are recognized by an antibody specific to the p50 subunit of NF-kappa B. **[SPLIT HERE]** By contrast, treatment of cells with pyrrolidine dithiocarbamate (PDTC) will only block LPS-induced NF-kappa B, but not the constitutive binding protein.\r\n- Stimulation of T-cells by agonistic anti-CD28 antibodies in conjunction with phorbol 12-myristate 13-acetate (PMA)- or TcR-derived signals induces the enhanced activation of the transcription factor NF-kappa B. **[SPLIT HERE]** Here we report that CD28 engagement, however, exerts opposite effects on the transcription factor AP-1.\r\n- In addition, cotransfection of a negative dominant molecule of PKC-zeta (PKC-zeta mut) with NF-kappa B-dependent reporter genes selectively inhibits the HIV- but not phorbol myristate acetate- or lipopolysaccharide-mediated activation of NF-kappa B. **[SPLIT HERE]** That PKC-zeta is specific in regulating NF-kappa B is concluded from the inability of PKC-zeta(mut) to interfere with the basal or phorbol myristate acetate-inducible CREB- or AP1-dependent transcriptional activity.\r\n- Inhibition of TNF-alpha secretion by LPS-stimulated THP-1-hGH cells was associated with a decrease in nuclear translocation of nuclear factor-kappaB. **[SPLIT HERE]** The capacity of GH to inhibit LPS-induced TNF-alpha production by monocytes without altering other pathways leading to TNF-alpha production may be of potential relevance in septic shock, since GH is available for clinical use.\r\n- In this manuscript we have investigated the molecular mechanisms by which T cell lines stimulated with phorbol 12-myristate 13-acetate (PMA) and phytohemagglutin (PHA) display significantly higher levels of NF-kappa B1 encoding transcripts than cells stimulated with tumor necrosis factor-alpha, despite the fact that both stimuli activate NF-kappa B. **[SPLIT HERE]** Characterization of the NF-kappa B1 promoter identified an Egr-1 site which was found to be essential for both the PMA/PHA-mediated induction as well as the synergistic activation observed after the expression of the RelA subunit of NF-kappa B and Egr-1.\r\n- The expression of many genes for which products are involved in inflammation is controlled by the transcriptional regulator nuclear factor (NF)-kappa B. **[SPLIT HERE]** Because surfactant protein (SP) A is involved in local host defense in the lung and alters immune cell function by modulating the expression of proinflammatory cytokines as well as surface proteins involved in inflammation, we hypothesized that SP-A exerts its action, at least in part, via activation of NF-kappa B. We used gel shift assays to determine whether SP-A activated NF-kappa B in the THP-1 cell line, a human monocytic cell line.\r\n- Similarly, a kinase-deficient mutant of NIK (NF-kappaB-inducing kinase), which represents an upstream kinase in the TNF-alpha and IL-1 signaling pathways leading to IKKalpha and IKKbeta activation, blocks Tax induction of NF-kappaB. **[SPLIT HERE]** However, plasma membrane-proximal elements in these proinflammatory cytokine pathways are apparently not involved since dominant negative mutants of the TRAF2 and TRAF6 adaptors, which effectively block signaling through the cytoplasmic tails of the TNF-alpha and IL-1 receptors, respectively, do not inhibit Tax induction of NF-kappaB. **[SPLIT HERE]** Together, these studies demonstrate that HTLV-1 Tax exploits a distal part of the proinflammatory cytokine signaling cascade leading to induction of NF-kappaB. **[SPLIT HERE]** The pathological alteration of this cytokine pathway leading to NF-kappaB activation by Tax may play a central role in HTLV-1-mediated transformation of human T cells, clinically manifested as the adult T-cell leukemia.\r\n- Our analyses of the induction of nuclear factor-kappaB (NFkappaB) in activated memory (CD45RO+) and naive (CD45RA+) T cell subsets from young and elderly donors has demonstrated that, regardless of donor age, memory T cells are not significantly altered in their responsiveness to TNF-alpha-mediated induction of NFkappaB. **[SPLIT HERE]** Although treatment with TNF-alpha induced nuclear localization of NFkappaB in both memory and naive T cell subsets, irrespective of the age of the donor, the levels of induced NFkappaB were significantly lower in both subsets of T cells obtained from the elderly, when compared to those in young.\r\n- Examination of IkappaB alpha regulation revealed that TNF-alpha-mediated degradation of IkappaB alpha in both memory and naive T cells from the elderly was severely impaired, thus contributing to the lowered induction of the observed NFkappaB. **[SPLIT HERE]** In addition, this age-related decrease in induction of nuclear NFkappaB correlated with decrease in intracellular IL-2 receptor expression and anti-CD3-induced proliferation of both memory and naive T cells subsets.\r\n\r\n**Undersplitting after \"kinase C.\" / \"kinase A.\"**\r\n- In contrast, anti-AIM mAb did not induce any change in the binding activity of NF-kappa B, a transcription factor whose activity is also regulated by protein kinase C. **[SPLIT HERE]** The increase in AP-1-binding activity was accompanied by the marked stimulation of the transcription of c-fos but not that of c-jun.\r\n- The stimulatory effect of gp160 on NF-kappa B activation is protein synthesis independent, is dependent upon protein tyrosine phosphorylation, and abrogated by inhibitors of protein kinase C. **[SPLIT HERE]** The gp160-mediated activation of NF-kappa B in CD4 positive T cells may be involved in biological effects, e.g., enhanced HIV replication, hypergammaglobulinemia, increased cytokine secretion, hypercellularity in bone marrow and apoptosis.\r\n- The phosphorylation of CREB that results in activation is mediated by protein kinase C rather than by protein kinase A. **[SPLIT HERE]** Although the CRE site is necessary, optimal induction of bcl-2 expression requires participation of the upstream regulatory element, suggesting that phosphorylation of CREB alters its interaction with the upstream regulatory element.\r\n\r\n**Undersplitting after \"CyA.\" or \"CsA.\"**\r\n- Induction of the PILOT gene is detectable in human T cells 20 min following activation in the presence of cycloheximide and is fully suppressed by CyA. **[SPLIT HERE]** The PILOT protein has a calculated M(r) of 42.6 kDa and contains three zinc fingers of the C2H2-type at the carboxyl-terminus which are highly homologous to the zinc finger regions of the transcription factors EGR1, EGR2, and pAT 133.\r\n- Transactivation by recombinant NFAT1 in Jurkat T cells requires dual stimulation with ionomycin and phorbol 12-myristate 13-acetate; this activity is potentiated by coexpression of constitutively active calcineurin and is inhibited by CsA. **[SPLIT HERE]** \r\n Immunocytochemical analysis indicates that recombinant NFAT1 localizes in the cytoplasm of transiently transfected T cells and translocates into the nucleus in a CsA-sensitive manner following ionomycin stimulation.\r\n- CONCLUSIONS: This study demonstrates that TF activation, occurring in mononuclear cells of cardiac transplant recipients, is inhibited by treatment with CsA. **[SPLIT HERE]** Inhibition of monocyte TF induction by CsA may contribute to its successful use in cardiac transplant medicine and might be useful in managing further settings of vascular pathology also known to involve TF expression and NF-kappaB activation.\r\n","closed_by":{"login":"DeNeutoy","id":16001974,"node_id":"MDQ6VXNlcjE2MDAxOTc0","avatar_url":"https://avatars.githubusercontent.com/u/16001974?v=4","gravatar_id":"","url":"https://api.github.com/users/DeNeutoy","html_url":"https://github.com/DeNeutoy","followers_url":"https://api.github.com/users/DeNeutoy/followers","following_url":"https://api.github.com/users/DeNeutoy/following{/other_user}","gists_url":"https://api.github.com/users/DeNeutoy/gists{/gist_id}","starred_url":"https://api.github.com/users/DeNeutoy/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/DeNeutoy/subscriptions","organizations_url":"https://api.github.com/users/DeNeutoy/orgs","repos_url":"https://api.github.com/users/DeNeutoy/repos","events_url":"https://api.github.com/users/DeNeutoy/events{/privacy}","received_events_url":"https://api.github.com/users/DeNeutoy/received_events","type":"User","site_admin":false},"reactions":{"url":"https://api.github.com/repos/allenai/scispacy/issues/100/reactions","total_count":0,"+1":0,"-1":0,"laugh":0,"hooray":0,"confused":0,"heart":0,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/allenai/scispacy/issues/100/timeline","performed_via_github_app":null,"state_reason":"completed"}