{"url":"https://api.github.com/repos/intel/dffml/issues/1287","repository_url":"https://api.github.com/repos/intel/dffml","labels_url":"https://api.github.com/repos/intel/dffml/issues/1287/labels{/name}","comments_url":"https://api.github.com/repos/intel/dffml/issues/1287/comments","events_url":"https://api.github.com/repos/intel/dffml/issues/1287/events","html_url":"https://github.com/intel/dffml/issues/1287","id":1110648706,"node_id":"I_kwDOCOlgGM5CMyeC","number":1287,"title":"docs: examples: innersource: Org health and issue prioritization","user":{"login":"pdxjohnny","id":5950433,"node_id":"MDQ6VXNlcjU5NTA0MzM=","avatar_url":"https://avatars.githubusercontent.com/u/5950433?v=4","gravatar_id":"","url":"https://api.github.com/users/pdxjohnny","html_url":"https://github.com/pdxjohnny","followers_url":"https://api.github.com/users/pdxjohnny/followers","following_url":"https://api.github.com/users/pdxjohnny/following{/other_user}","gists_url":"https://api.github.com/users/pdxjohnny/gists{/gist_id}","starred_url":"https://api.github.com/users/pdxjohnny/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/pdxjohnny/subscriptions","organizations_url":"https://api.github.com/users/pdxjohnny/orgs","repos_url":"https://api.github.com/users/pdxjohnny/repos","events_url":"https://api.github.com/users/pdxjohnny/events{/privacy}","received_events_url":"https://api.github.com/users/pdxjohnny/received_events","type":"User","site_admin":false},"labels":[{"id":1264621657,"node_id":"MDU6TGFiZWwxMjY0NjIxNjU3","url":"https://api.github.com/repos/intel/dffml/labels/documentation","name":"documentation","color":"57a5f9","default":true,"description":"Changes to documentation"},{"id":3907615972,"node_id":"LA_kwDOCOlgGM7o6Xzk","url":"https://api.github.com/repos/intel/dffml/labels/usecase/innersource","name":"usecase/innersource","color":"5339A4","default":false,"description":""}],"state":"open","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":10,"created_at":"2022-01-21T16:10:42Z","updated_at":"2022-12-05T21:03:28Z","closed_at":null,"author_association":"MEMBER","active_lock_reason":null,"body":"@yashlamba @sakshamarora1 and I talked about this last night in relation to @builtree\r\n\r\n- https://patterns.innersourcecommons.org/\r\n- https://intel.github.io/dffml/main/examples/innersource/index.html\r\n\r\nAs a reminder, we are interested in InnerSource and the OpenSSF identifying security threats work being done in the open source community because it ties back to our initial mission with open source dependency security / maintainability analysis. This work also helps our project (dffml) as we scale out to understand how we can work more effectively across our plugins and the main package. This work also relates to coming up with ways to help the builtree organization scale and be more effective.\r\n\r\nWe talked about the existing InnerSource demos and how the goal of InnerSource as is it to enable more frequent changes of higher quality with increased reuse and contribution happening across an organization (such as builtree). We talked about how the one could use the [CII best practices badging program](https://github.com/coreinfrastructure/best-practices-badge) as metrics, [example](https://bestpractices.coreinfrastructure.org/en/projects/1/0#analysis).\r\n\r\nMetrics can also be used to help projects get visibility so that others are aware of their feature sets when they need to reuse a project or aspects of a project. Feature set collection is also useful for analysis of what project efforts need to be joined/consolidated due to similar feature sets (for example the same set of functions in two python projects `utils.py`).\r\n\r\n Metrics can also be about people, this person is at skill level 0-5 for JavaScript, our model could tell us that investing a mentors time in helping them learn JavaScript would accelerate development across projects faster than that mentor talking another issue. (Increase in overall production output, civilization terminology)\r\n\r\nbuiltree has several projects which have potential cross project collaboration (we talked about dffml and the secret vault for the generic CI/CD work). Identification of feature sets helps determine where more opportunities for cross project collaboration exist. it also helps when contributors want to propose a new project, to identify if a similar project already exists. This ties into the [inventory](https://github.com/intel/dffml/pull/1207#discussion_r711843933).\r\n\r\nWe talked about how investing in driving up metrics now (before GSoC season) will pay off big in terms of less manual review needing to be done and making contributors more autonomous and enabled to do great work (quality docs, tests, etc.).\r\n\r\nWe should consider creating some kind of org level health metrics. So that we can see the reuse and contribution happening from maintainers and contributors across projects (cross pollination, metric which describes health of set of projects, potentially the set of projects is the whole org).\r\n\r\nWe also talked about implementing InnerSource for an open source org could help senior folks in an org prioritize what they should work on when they have a role to help all the projects across the org when needed. Having this traceability and data on potential impact of work (this ties in with the estimating time to complete issue stuff from #1279) allows org admins / maintainers to make data driven decisions about what to work on. They will have a model to see that closing issue X increases throughput or quality, or both across all projects in the org by Y amount (time to close other issues shrinks) as estimated by the model / data flow.\r\n\r\n---\r\n\r\nThe presentation we did at bsides pdx 2019 shows how we developed methodology for an event driven CI/CD pipeline which yielded insights into open source project maintenance and security posture. The work in this issue is a potential avenue to another presentation. One where we show how we continued work on our CI/CD + ML project to gather further insights on open source projects, including our own. Then though application on InnerSource principles within our orgs, we use those insights to build more effective organizations.\r\n\r\n- What you're using\r\n  - SBOM and Allowlist tool / presentation\r\n- How you're using it\r\n  - Data flow as standard architecture\r\n- Should you be using it or something else\r\n  - InnerSource","closed_by":null,"reactions":{"url":"https://api.github.com/repos/intel/dffml/issues/1287/reactions","total_count":0,"+1":0,"-1":0,"laugh":0,"hooray":0,"confused":0,"heart":0,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/intel/dffml/issues/1287/timeline","performed_via_github_app":null,"state_reason":null}